Overload List
Name  |   Description
AddDefinition(String, GeometryObject)
 Add a definition to be reused by instances. A definition is a single geometry object.
AddDefinition(String, IList GeometryObject )
 Add a definition to be reused by instances. A definition is a collection of geometry objects.
 See Also
  DirectShapeLibrary Class
  DirectShapeLibrary Members
  Autodesk.Revit.DB Namespace